{"From Arrogant Guy to Sexy Maid!":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7405&ageconsent=ok&warning=3'","author":"CorruptedHeroines","authorUrl":"viewuser.php?uid=16307","summary":"Those reincarnation goddesses lied to me. I was supposed to get an easy life as King in another world, but…\nInstead something completely different happened!... /&gt; Now I have to clean and serve as a maid for the entire Order of female Knights? And they also have something else between their legs... and I have to clean that too!\n+++\nA new adventure in another world does not go at all like expected!\n[TG, Gender Bender, Smut, Futanari]"},"The Sorceress and the Unicorn":{"titleUrl":"viewstory.php?sid=7381","author":"Shannon Colby","authorUrl":"viewuser.php?uid=7366","summary":"Dennis is a research magician who wants nothing more than to live a solitary life in the Adamantine Palace among his books.  But when he discovers a unicorn egg, his life and his gender are turned upside down.\n\nNow Denise, she moves to Briargate, an all-woman community where her unicorn can grow up safely.  But there are forces at work, both ancient and modern, that wish to destroy Briargate.  The solitary sorceress must learn that she might need more than magic to save her new town.\n\nShe'll need friends, too."},"Is it really my choice?":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7329&ageconsent=ok&warning=3'","author":"unknown08","authorUrl":"viewuser.php?uid=16278","summary":"Nate is an ordinary teenage boy. If you count living in a homeless shelter normal. When he turns 18 he has a choice to go live by himself with the men or turn into a women to stay with his mom and sis. Little does he know his mom will choose for him."},"The Goblin's Pet":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has deviant content. It may depict one or more illegal and or immoral activities. Your laws may limit your lawful reading of such material. -- 1')) location = 'viewstory.php?sid=7391&ageconsent=ok&warning=4'","author":"aphrodite","authorUrl":"viewuser.php?uid=14679","summary":"When Aldric, a revered hero, gets locked into a magical collar and transformed into a buxom beauty, he's ensnared in a life of torment and arousal, forced to serve a devious goblin master."},"Self Discovery":{"titleUrl":"viewstory.php?sid=7047","author":"Amaty","authorUrl":"viewuser.php?uid=15534","summary":"Jacob is a normal, albeit reclusive, teen in every way except one. When his secret hobby and a boy collide, he comes to discover who he truly is."},"One-Shots!":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7214&ageconsent=ok&warning=3'","author":"vezli","authorUrl":"viewuser.php?uid=15849","summary":"A trove of transformative tales! Rather than clog up the main page with lots of short entries, they'll be gathered here with each chapter a new addition. Images are AI generated, text is by me!"},"Second Pass":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7399&ageconsent=ok&warning=3'","author":"dwbelmont","authorUrl":"viewuser.php?uid=16366","summary":"Leo Evans, in his mid-30s at a dead end job as a paralegal finds himself wishing could change his circumstances. Upon the appearance of a strange trunk in his apartment, he finds himself able to do just that."},"Magical Girl Exorcist Squad: One-Shot Issues":{"titleUrl":"viewstory.php?sid=7425","author":"ZatannasLovelyAssistant","authorUrl":"viewuser.php?uid=16174","summary":"A series of standalone issues set between seasons of the main MGES saga to provide greater insight into the characters."},"Popularity of the Unexpected kind":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7397&ageconsent=ok&warning=3'","author":"SexyBex1985","authorUrl":"viewuser.php?uid=15204","summary":"Charlie Owens had recently graduated from high school whilst moving in with his older sister, who worked for a PR and Marketing agency having some of the world’s biggest names as clients. When a problem arises with his sister's job…will Charlie step up and help her…no matter what it takes? How far will he be willing to go?"},"Gym Bod (Short Story)":{"titleUrl":"viewstory.php?sid=7424","author":"Nothing To See Here","authorUrl":"viewuser.php?uid=14524","summary":"Nikki hid in one of the lockers in the men's locker room at her local gym to record them changing, but when she left the locker, she gets caught and faces a fitting punishment"},"Girlhood":{"titleUrl":"viewstory.php?sid=7281","author":"Amaty","authorUrl":"viewuser.php?uid=15534","summary":"Tyler is the definition of a nuisance of a teen boy. When he gets expelled from school, his only option is to go to an girl's school. Surely, nothing will happen that changes how he sees himself. Right?"},"Beau and The Beast":{"titleUrl":"viewstory.php?sid=7423","author":"danifish879","authorUrl":"viewuser.php?uid=15604","summary":"When bookish Beau's father discovers his child's big secret, Maurice seeks the enchanted castle to find a way to help them in this queer adaptation of Beauty and the Beast."},"Devils in the Walls":{"titleUrl":"viewstory.php?sid=7396","author":"PunchlinePress","authorUrl":"viewuser.php?uid=14351","summary":"Set in the fictional Kyodai-toshi's 9th Ward, it follows the journey of Iwasaki Akito as he finds himself thrust into a world he never could have expected, facing down supernatural threats from beyond the veil between worlds. Serving as a love letter of sorts to all the TG anime and manga I've consumed over the years, mixed with a dark take on the sentai/magical girl genres, I hope you find it as enjoyable as I've found such media over the years.\n\nCW for graphic depictions of violence, gore, and death."},"Moonlit Waters":{"titleUrl":"viewstory.php?sid=6989","author":"September","authorUrl":"viewuser.php?uid=15590","summary":"\"I'm just scared somehow that you're not even real.\"\n\"And what if I wasn't? What if I wasn't, but wanted to be?\"\n\nWhen Timothy Crow gets the ability to turn into a girl whenever he goes swimming, his first reaction is to panic, resulting in his near death by drowning. \nOf course, the one who shows up to save him is his best friend Alex. Alex, who Timothy has been trying to avoid meeting in person recently.\nTimothy decides to use this second identity to rekindle the bond between him and his friend, but he seems to be missing something.\nWhy has his depression so suddenly vanished? \nWhy does being a different person feel so much better?\nWhat will happen when Alex takes an obvious liking to the mysterious girl he met at the lake, who doesn't seem to exist in the light of day?\nIn the hottest summer in decades, as a comet with allegedly magical properties circles Earth, a seemingly normal boy sets out on a journey toward self-discovery and love."},"Cate Fox and the Case of the Fading Magic":{"titleUrl":"viewstory.php?sid=7341","author":"tfes8","authorUrl":"viewuser.php?uid=8090","summary":"Welcome to Puellae Aurora Academy! PAA is an exclusive high school for students who have recently undergone gender transformation - commonly referred to as having been TG’d. At Puellae Aurora, we will take great care of your daughter, son, or nonbinary teenager. In addition to our excellent academic track record, your teen will learn what it means to be a TG, and how to best adapt to a less-tolerant outside world. Our students are given space and freedom to become productive, capable, and sociable young adults. Professional and nurturing faculty members, many of them PAA alumni, are on hand to guide your teen…\n \nEnter Jack Baker. Jack is a seasoned detective with expertise in finding missing persons. That is, until an encounter with a Body Hopper. Now, stuck in the body of a 14-year-old teenage girl, Jack is enlisted by Puellae Aurora Academy to go undercover as a student to solve their missing person cases before all of the magic is gone."},"www.changeme.com":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7275&ageconsent=ok&warning=3'","author":"Connie Hollis","authorUrl":"viewuser.php?uid=16167","summary":"There’s a sound on the internet that hypnotizes the listener and changes them into a girl. There’s hundreds all over, but this one works, this one, is real.\n\nDesmond is a miserable 14 year old guy. His only real friends are his brother, who’s a year older, and his cousin, who doesn’t even go to the same school. One day while going through the internet, he clicks on a link to a website, that plays a video that changes him to a girl."},"Mirror Changed":{"titleUrl":"viewstory.php?sid=6900","author":"Alyss_N_Onymous","authorUrl":"viewuser.php?uid=15488","summary":"Imagine if there were quasi-sentient fields of energy that gained their power from everything that they were attached to.  Or perhaps gave power to everything they had connection with.\n   One the great field of Gaia.  Of all creatures that ever were and ever will be.\n\n   The other that of the creations of Mankind.  The factors that make up all of Civilization.\n   Because of the excesses of one and the hyper conservativeness of the other they find themselves at war.  Often to the point of Genocide.\n   Into this world Jayde Lewis is thrust.  With no warning, no notice, and no handy guidebook to help him out."},"Inherited Zeal":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=6746&ageconsent=ok&warning=3'","author":"Tegeli","authorUrl":"viewuser.php?uid=14721","summary":"Romantic planetary romance novella, set on a windswept frontier dotted with plague-infested ruins.\n\nA self-exiled remittance man is forced from his stupor, when his regular allowance is forwarded further into the interior of an untamed continent. To escape his debtholders, he dons the guise of a woman, only to find the role more permanent than only the duration of a voyage across the steppe. In the faded sunlight, the shades of the past remain ahead.\n\nTakes place on the same world as 'Fervour of the Past'."},"Dancing in heels":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7393&ageconsent=ok&warning=3'","author":"Silly Sissy Salad","authorUrl":"viewuser.php?uid=15705","summary":"I love to dance and I spend a lot of time in cardio classes practising my moves... it's how I find happiness. When my best friend loses his partner, he asked me to fill in to help him practise while he finds a new partner... but I'm not sure he's really trying that hard to find a replacement..."},"Pink Candy Addiction":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7400&ageconsent=ok&warning=3'","author":"vezli","authorUrl":"viewuser.php?uid=15849","summary":"Riley has a new favorite candy and it's going to cause changes for him and his girlfriend."},"UwU":{"titleUrl":"viewstory.php?sid=7421","author":"ReluctantWriter","authorUrl":"viewuser.php?uid=16115","summary":"\"Like, all I did was joke around with my stream viewers about turning into an anime girl, teehee! But then MagiChanger's magic, like, actually worked and now I'm a total kawaii cosplay diva! My silly followers were so surprised when the spell made me completely perfect, but I'm ready to give them an exclusive show, OwO!\""},"The Lilith Saga":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7137&ageconsent=ok&warning=3'","author":"mrglfmf","authorUrl":"viewuser.php?uid=15368","summary":"A mysterious valve sets three young men and a woman on a path to glory."},"Shame and Desire":{"titleUrl":"viewstory.php?sid=6474","author":"LeftyPosting","authorUrl":"viewuser.php?uid=14757","summary":"A long time fan of TG content is forced to confront the truth of why they're so obsessed with that kind of fiction."},"Magical Girl Exorcist Squad: Love Thine Enemy (season 1)":{"titleUrl":"viewstory.php?sid=7257","author":"ZatannasLovelyAssistant","authorUrl":"viewuser.php?uid=16174","summary":"The saga of young trans woman realizing her identity and joining a magical girl squad... Much to the chagrin of everyone involved, including herself. \n\nAn all-new urban fantasy saga in the vein of both 'Sailor Moon' and 'The Exorcist.'"},"Parallel Lives":{"titleUrl":"viewstory.php?sid=6758","author":"LeftyPosting","authorUrl":"viewuser.php?uid=14757","summary":"What would you do if you learned that your entire life, all your memories and experiences, may have been false?"},"30 Days of Gifts":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7376&ageconsent=ok&warning=3'","author":"vezli","authorUrl":"viewuser.php?uid=15849","summary":"Gifts from a stranger - What could be better? 30 gifts over 30 days and each one changes you a little more. *** You don't know me, but I know you. I've been watching you, and I know your secret. You're not much of a manly man are you? That's okay. I like my boys a little...girly. *** Includes 30 AI generated images!"},"Love Bites (Back)":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7419&ageconsent=ok&warning=3'","author":"Purgatory Saint","authorUrl":"viewuser.php?uid=14437","summary":"Samuel Bennett has been in love with Amanda Brookfield ever since junior year of high school. Now they're freshmen at college and Amanda just broke up with her boyfriend of eight years. Now's the time to confess his love... now's the time to tell her how he really feels!\n\nBut then the zombie apocalypse went and ruined everything, trapping him inside the body of his high school crush and dooming him to a half-life for all eternity. Oof..."},"Cassandra Ascendant: The Dawn of a New Species":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has deviant content. It may depict one or more illegal and or immoral activities. Your laws may limit your lawful reading of such material. -- 1')) location = 'viewstory.php?sid=7420&ageconsent=ok&warning=4'","author":"ReluctantWriter","authorUrl":"viewuser.php?uid=16115","summary":"James's groundbreaking nanotechnology experiment goes awry when a jealous colleague steals his research, accidentally transforming James into the irresistibly seductive Cassandra, determined to create a perfect new species."},"How did I get here?":{"titleUrl":"viewstory.php?sid=7411","author":"Soapamine","authorUrl":"viewuser.php?uid=16384","summary":"Atticus Hanks has just lost his beloved Aunt and has been struggling with this loss and it has impacted his grades. Now forced to choose between taking the zeros or be in Mr. Conrad's school play, he wonders what he should do? (Probably some therapy to be honest.)"},"The Arbiter: Reborn":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7416&ageconsent=ok&warning=3'","author":"Purgatory Saint","authorUrl":"viewuser.php?uid=14437","summary":"Over 20 years ago, Earth's most formidable superhero died mysteriously. Now, in the year 2026, a new hero emerges with powers similar to the once great hero. Who is this mysterious superhero and can she survive Guardian University, the most elite superhero training facility in the world?"},"Femdemic: Zack's Story":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7418&ageconsent=ok&warning=3'","author":"TheSpiralledEye","authorUrl":"viewuser.php?uid=15372","summary":"Zack knew it had been a stupid risk; all the warning signs were there. Now he’s infected and slowly turning into a woman thanks to the Femdemic sweeping the nation and has to figure out not only how to avoid being snatched up as a government lab rat but how to come to peace with his new body."},"A Halloween Goal":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7332&ageconsent=ok&warning=3'","author":"Story454","authorUrl":"viewuser.php?uid=11833","summary":"Karl has always held making money as one of his highest goals. When it comes to winning a friend's costume contest for the prize money, he is going to need all the help he can get. Luckily his girlfriend Sara and a mysterious statue are more than happy to help him achieve his goal."},"The Other Side of Me":{"titleUrl":"viewstory.php?sid=5410","author":"Lily Rasputin","authorUrl":"viewuser.php?uid=10705","summary":"As excited as my best friend was to show me his latest invention, I should have known from past incidents there was a fairly good chance something was going to go wrong. And did it ever!"},"Cats and Women Will Do as They Please":{"titleUrl":"viewstory.php?sid=7417","author":"Jophiel Joyner","authorUrl":"viewuser.php?uid=5175","summary":"Cats and Women Will Do as They Please: I Was a Crossdresser Hired as a 9-5 Goddess to Lead the Heroes to Defeat the Demon King  is about a Crossdresser Hired as a 9-5 Goddess to Lead the Heroes to Deffeat the Demon King."},"Shifting":{"titleUrl":"viewstory.php?sid=7368","author":"SelkieTG","authorUrl":"viewuser.php?uid=16340","summary":"A husband tries to work out what's changed in his marriage recently, not quite able to put his finger on it."},"Robin's Wish":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7401&ageconsent=ok&warning=3'","author":"ThePrincessLink","authorUrl":"viewuser.php?uid=13887","summary":"Robin is a man in his late 20s who is helping his parents move some boxes that once belonged to his late grandmother. While doing so Robin comes across a wishing book and wishes that he could be the child his mother could relate to which alters his life in many ways. Will Robin find his way back or does his mother perhaps have other plans for her new daughter?"},"Seamless Unity":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7414&ageconsent=ok&warning=3'","author":"GlitchMermaid","authorUrl":"viewuser.php?uid=16415","summary":"Harper is feeling that his life are going to waste while he spends all his time at his suburban home, reading. When he reached twenty, he got invited to enroll in a special secret society owned University, filled with the future leadership of humanity. But Harper got the pink envelope, not the blue one! \nHe must enroll in the school as female, and while he is becoming a model student, he also learns his future place in society, and things are starting to get very real."},"Femdemic: Peter's Story":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7413&ageconsent=ok&warning=3'","author":"TheSpiralledEye","authorUrl":"viewuser.php?uid=15372","summary":"Peter wakes from an amazing night out only to find himself slowly changing into something very different. Unbeknownst to him, he has been infected with an alien virus that transforms men into women, one cell at a time..."},"Two from One":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7310&ageconsent=ok&warning=3'","author":"thet0wer","authorUrl":"viewuser.php?uid=15819","summary":"Big things have small beginnings."},"Nothing's Changed":{"titleUrl":"viewstory.php?sid=7408","author":"SelkieTG","authorUrl":"viewuser.php?uid=16340","summary":"Just the start of a normal working day, as our male character waits for a bus, naked but for his usual collar and heels. Except, something about his small breasts, and plugging himself into his berth on the bus for his Kezini rider, seems confusing."},"Wishing In West Texas":{"titleUrl":"viewstory.php?sid=7409","author":"C C Mala","authorUrl":"viewuser.php?uid=16353","summary":"A hapless cowboy is coaxed into divulging his most secret desire to a seemingly innocent old lady. His wish is granted in the most unexpected way. A word of advice, never assume the person you are talking to is not a witch. Better safe than sorry!\n\nThis is the first of three chapters - so hold onto your hat and check back often for bi-weekly (twice-a-week) updates.\n\nAnd don't forget to leave comments! The more feedback I get, the better the stories are that I write."},"Purrfectly Me":{"titleUrl":"viewstory.php?sid=7410","author":"Amaty","authorUrl":"viewuser.php?uid=15534","summary":"A young man gets a job at a cat cafe only to find out it has an event where all the staff have to crossdress after his first day working there. Follow Nate on their daily life as they slowly find out about themselves."},"Photograph":{"titleUrl":"viewstory.php?sid=7406","author":"totalgirliegirl","authorUrl":"viewuser.php?uid=15854","summary":"A trans woman makes a wish to relive her childhood, but instead ends up in the childhood of her biological mother, a high school freshman in the fall of 1984.\n\nBeing raised by the wrong parents in the wrong state, with all the wrong hairstyles and technology, she is faced with a choice. Does she try to find a way out? Can she cope with never seeing her real family again? Or is this the childhood she always wanted?"},"All my Stars and Constellations":{"titleUrl":"viewstory.php?sid=7407","author":"Korra Del Rio","authorUrl":"viewuser.php?uid=3923","summary":"The realms are in silent crises as the Imperials have laid waist to a kingdom of Taurus. For their sin of love shared between an Imperial Orion and a kingdomly Taurus son of the bull. They’ve crossed lines and now their love child will bare the fruit of change. As the Imperium comes of age old civilizations return to see what’s become of a cast off planet ruled now by stars of power from an  alternate dimension. Thrice forces mechanizing the fate of one strange child for to whom power overwhelming is assured."},"To be a Woman":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7404&ageconsent=ok&warning=3'","author":"RavenPrincess","authorUrl":"viewuser.php?uid=16409","summary":"A story about getting to grow up again, the way you always wanted."},"Into the Rabbit Hole":{"titleUrl":"viewstory.php?sid=7335","author":"Miss Scarlett","authorUrl":"viewuser.php?uid=16283","summary":"Victor had everything in the world until a fateful tragedy occurred, triggering a chain of subsequent tragedies that compelled him to make life-altering decisions."},"Folie a Deux":{"titleUrl":"viewstory.php?sid=7199","author":"Aedilear","authorUrl":"viewuser.php?uid=13543","summary":"College student Theo tries to do a magic ritual to prove the existence of magic to his skeptical friend Hector. An offhand comment and a magical overreaction later, and both Theo and Hector find themselves transformed, and yet Hector-- now Hailey-- still doesn't believe?"},"I Will Have Revenge":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7312&ageconsent=ok&warning=3'","author":"Connie Hollis","authorUrl":"viewuser.php?uid=16167","summary":"My name is Neil Jackson. I was framed for a crime I didn’t commit, by my own brother, so that my wife would divorce me and he could marry her. He even adopted my daughters who all turned their back on me. Thinking I did this thing. It’s been 14 years since I entered prison, today I get released, and I work on getting revenge."},"The Voice":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7402&ageconsent=ok&warning=3'","author":"Razmagurk","authorUrl":"viewuser.php?uid=10658","summary":"The magic voice inside Fin's head is telling him it's the first day of the rest of his life - as a sexy girl! Now it's a struggle to hold on as it systematically rewrites his reality, one step at a time. Will he be able to resist? Will he even want to? What's so important about his masculinity anyway? Come on, sweetie, life's more fun this way, isn't it?"},"Parturient":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7231&ageconsent=ok&warning=3'","author":"The Wolf among the Woods","authorUrl":"viewuser.php?uid=16105","summary":"Twenty-one year old Darren Michaelson has lived an easy life of good fortune, never having to fight for what he wanted or needed, never even having to assert himself unnecessarily. Unfortunately, his naive practice of not asking questions and taking things as they come has led him to a cliff-face in his life when Babel, a Demoness of many names, decides it's high-time he pay up for his good fortune."},"Where No Man has Gone Before":{"titleUrl":"viewstory.php?sid=2867","author":"Mopar","authorUrl":"viewuser.php?uid=6028","summary":"Reginald Barclay discovers that space is not the final frontier."},"Demon Witch Women":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=3051&ageconsent=ok&warning=3'","author":"Lethaldaza","authorUrl":"viewuser.php?uid=711","summary":"(Updated Version formally Cheerleaders) my friend and I were at the wrong place at the wrong time when the cheerleaders come back then we were caught by them something was going to change me forever"},"Facility B":{"titleUrl":"viewstory.php?sid=6503","author":"Aprille Blossom","authorUrl":"viewuser.php?uid=14902","summary":"In the not so distant future, a mysterious virus has arisen that prevents women from birthing female children. In a scramble to find a solution to this new global crisis, Facility B is established - a transitioning facility for young adults, chosen at random by the government. But is this Facility what it appears to be on the surface? Or is something far more mysterious happening here? Follow Kris as he is \"selected\" to attend this facility, and prepare yourself for a wild ride as he delves deep into the strange and mysterious complex. First story ever posted! Inspired by the works of many great authors on this site and elsewhere. I sincerely hope you enjoy!"},"A Lesson in Transience":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=6948&ageconsent=ok&warning=3'","author":"RoryRouses","authorUrl":"viewuser.php?uid=15523","summary":"Thirty-year-old Chris undergoes a fairly common yet mysterious condition called \"transience\" in which humans turn into various races we would see in a fantasy world. How will his life irreparably change after receiving the diagnosis that his days as both a man and a human are numbered?"},"My second life as a sexy maid":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7398&ageconsent=ok&warning=3'","author":"CorruptedHeroines","authorUrl":"viewuser.php?uid=16307","summary":"Reincarnation is never a simple affair, but when you offend the goddess, you might find yourself thrown into a new world, in the body of a sexy girl... and as a maid to a temple full of horny futas. And also your breasts might be growing with each day. Uh-oh.\n\nA short snippet set in the world of one of my novellas."},"A Model for CC's":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has deviant content. It may depict one or more illegal and or immoral activities. Your laws may limit your lawful reading of such material. -- 1')) location = 'viewstory.php?sid=5952&ageconsent=ok&warning=4'","author":"Fibaro","authorUrl":"viewuser.php?uid=11775","summary":"With Linda's CC boutique growing she needs a model to update her website and advertise, a nice opportunity for a new personal project of hers.\n\nThis is a standalone story based in the universe of “Neighbourhood Terror to Sissy” reading that first might be advised."},"The Latex Doll":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7392&ageconsent=ok&warning=3'","author":"SophieMcardy","authorUrl":"viewuser.php?uid=16380","summary":"From being a mans man, Liam very quickly becomes a subservient fetish doll to multiple people. This story is a mix between truth, fiction and fantasy of a mans fall into a fetish plaything"},"Sister Act":{"titleUrl":"viewstory.php?sid=7362","author":"vanillathunder","authorUrl":"viewuser.php?uid=12758","summary":"When his sister gets herself grounded the night of a big party, she enlists Charlie's help to pose as her so that their mom won't find out that she snuck out. It was only supposed to be until Cheryl got home, but unfortunately, things are never quite that simple."},"Myriam's Bar of Exotic Pleasures":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7395&ageconsent=ok&warning=3'","author":"WriteTheTG","authorUrl":"viewuser.php?uid=14753","summary":"The day has come for Myriam to open the bar of her dreams. Tonight is the grand opening. She hopes her patrons enjoy their cocktails; she knows from experience their transformative powers."},"Officer Candi (Wrapper)":{"titleUrl":"viewstory.php?sid=7394","author":"cazcow","authorUrl":"viewuser.php?uid=16388","summary":"A down-on-his-luck traffic cop has an unfortunate meeting a grumpy old man."},"The easy way out...":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7320&ageconsent=ok&warning=3'","author":"Silly Sissy Salad","authorUrl":"viewuser.php?uid=15705","summary":"Boy being naive and fate coming around to remind him."},"Hiding in plain sight ":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=5711&ageconsent=ok&warning=3'","author":"Bella Rossa","authorUrl":"viewuser.php?uid=13113","summary":"Kyle lead a fairly simple life. Wake up, grab whatever it is he was commissioned to steal, and be back home in time for dinner. That all changes when he's intercepted during one of his crimes, and finds himself in a situation he can't sneak out of without help..."},"Ketan's Life":{"titleUrl":"viewstory.php?sid=7372","author":"Ishi","authorUrl":"viewuser.php?uid=16348","summary":"Story of a young Indian boy who enters college and how his life changes."},"Happy Wife, Happy life":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7390&ageconsent=ok&warning=3'","author":"FoxFace","authorUrl":"viewuser.php?uid=15314","summary":"Months ago after a bad alteration with a witch, a curse turned Alex into his best friend Colin’s attractive wife and compelled the two to constantly sleep together. Now stuck as Amber and five months pregnant, she is understandably annoyed about being stuck as her best friend’s submissive, hot wife. Colin, a total graph nerd, tries to help her come to terms with her new life with a Positives, Negatives, and Interesting Chart."},"The Party":{"titleUrl":"viewstory.php?sid=6969","author":"AnnaliseB","authorUrl":"viewuser.php?uid=11602","summary":"Edward didn't have a great start to his life, but with so many strong feminine influences along the way, surely destiny is calling..\nStarting when he was a child, Edward's female figures were strong, with his Mum and two big sisters. In his twenties, he found himself flat-sharing with the lovely Lily. With 'Emily' still hidden away, read on for their adventures..."},"Stranded":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7339&ageconsent=ok&warning=3'","author":"Connie Hollis","authorUrl":"viewuser.php?uid=16167","summary":"A plane crash leaves over 100 male high school students stranded on an island. But it doesn’t end there. One by one genders begin to change, until half of them are girls. And clothes are running out.\n\nMultiple POV characters, multiple gender changes"},"The Trials of Artemis":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7363&ageconsent=ok&warning=3'","author":"Elena Lawson","authorUrl":"viewuser.php?uid=16332","summary":"Two friends decide to ignore the warnings given to them, but only one of them leaves alive. Can Eric overcome the guilt of inadvertently getting his best friend killed? Can he pass the trials assigned to him? Will he be able to cope with the complicated feelings his slowly changing body is giving him?"},"The College Experience":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7086&ageconsent=ok&warning=3'","author":"totalgirliegirl","authorUrl":"viewuser.php?uid=15854","summary":"Five years out of college, Alex gets mugged on vacation, and desperately agrees to an online ad to steal panties from a sorority for $500. Laura, the leader of the sorority, is fed up with men constantly treating women like sex objects and getting away with it, so she decides to teach Alex a lesson he'll never forget. Whether he likes it or not, Alex is about to have a second college experience, and this one will be very, very different."},"The Chocolate Bar of Destiny: An Unexpected Blessing":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7373&ageconsent=ok&warning=3'","author":"C C Mala","authorUrl":"viewuser.php?uid=16353","summary":"John has a thing for Indian girls, a lustful preoccupation that drives him to make poor choices with life-changing consequences."},"The Life of a Sissy":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7352&ageconsent=ok&warning=3'","author":"AlexClemmens006","authorUrl":"viewuser.php?uid=6549","summary":"I woke up that one fateful day when my life changed. Overnight I transformed from a scrawny acne-ridden teenage boy to a well-endowed teenage girl with a secret. During the journey I embark on, I learn about my family, friendships, and romance."},"Escape, but no escape":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has deviant content. It may depict one or more illegal and or immoral activities. Your laws may limit your lawful reading of such material. -- 1')) location = 'viewstory.php?sid=7389&ageconsent=ok&warning=4'","author":"Bound","authorUrl":"viewuser.php?uid=16368","summary":"Forced to become a girl in the midst of Russian politics, one can escape Russia, but no escaping from been a girl. Lots of forced sex, BDSM and such."},"Wings":{"titleUrl":"viewstory.php?sid=6810","author":"Trismegistus Shandy","authorUrl":"viewuser.php?uid=8445","summary":"The strange new machine at the library represented endless possibilities, possibilities for finding the right shape she was supposed to be, but her parents had forbidden her to use it. Well, what they didn't know wouldn't hurt her.\n\n(Sequel of sorts to Pioneers, but should stand alone.)"},"A Girl, a House and a Secret":{"titleUrl":"viewstory.php?sid=7325","author":"Trismegistus Shandy","authorUrl":"viewuser.php?uid=8445","summary":"Fired from her teaching job after being outed as trans, Jenny Brand was offered a tutoring job for a disabled child of a wealthy family. But why so much secrecy surrounding the job?"},"45th Annual Gala of Tiresias":{"titleUrl":"viewstory.php?sid=7367","author":"Clara","authorUrl":"viewuser.php?uid=9555","summary":"Skyler finds himself in an awkward situation and, because the situation could lead to a huge scholarship, all the women in his life seem to want to keep him in that situation. \n\nAs I have done in a previous story, there are links posted at the end of each chapter that will bring you to a YouTube version of the music mentioned. There’s only one link for this chapter, but there will be more as the story progresses. Please feel free to leave comments! \n\nA QUICK NOTE: This was a long and somewhat challenging story for me, AND it was written during the most busy, exhausting and frustrating six months of my life. I hope it appeals to you. If it doesn’t, that’s cool, too, but regardless, it was my link to sanity during a tough time."},"Insomnia Cure":{"titleUrl":"viewstory.php?sid=7388","author":"Connie Hollis","authorUrl":"viewuser.php?uid=16167","summary":"Arnold Harrison suffers from extreme insomnia, he goes in to the clinic when day to try and cure him of it."},"Lady Eugenia and the Innara Talisman ":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7387&ageconsent=ok&warning=3'","author":"InnaraTalisman","authorUrl":"viewuser.php?uid=16367","summary":"A regency period member of the English nobility has a problem, her husband is not attracted to her. A parcel she receives in the mail from an archaeologist friend may be able to help."},"Thunderbird and the Unktehila, Daughter of Lightning, Son of Thunder":{"titleUrl":"viewstory.php?sid=7385","author":"Inanna","authorUrl":"viewuser.php?uid=4759","summary":"Jeff is a loner with a terrible burden on his soul as he deals with gender identity issues. He and his family are camping near an ancient effigy mound of the Thunderbird. He accidentally awakens something that has slept for almost a thousand years. The awakened spirit calls out to Shannen, a witch who's powers are constrained by her own gender misalignment. They are brought together and through a ritual they swap bodies and lives. This is a five part story and takes place over the period of two years."},"BFF":{"titleUrl":"viewstory.php?sid=7386","author":"TG-Chrissie","authorUrl":"viewuser.php?uid=16365","summary":"Short and simple story about young crossdresser and his best friend."},"Artificial Puberty":{"titleUrl":"viewstory.php?sid=7266","author":"Wassuper12","authorUrl":"viewuser.php?uid=16090","summary":"In the future, everyone must choose what puberty they want to go through. A young Alex wants to grow into a tall and strong man, but their mother has always wanted a daughter of her own. Who will get their way, and what will Alex’s future have in store?"},"From Soccer to Sucker":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7000&ageconsent=ok&warning=3'","author":"Fibaro","authorUrl":"viewuser.php?uid=11775","summary":"Jake the captain of the male soccer team and a real womanizing a****** get's tricked into a bet by Valeria the captain of the female soccer team. Using this bet and his ego she slowly manipulates him into becoming a sissy who is way nicer to be around."},"Rock the World, Jamie Jones":{"titleUrl":"viewstory.php?sid=7384","author":"Alternativeaccount11","authorUrl":"viewuser.php?uid=15642","summary":"Jamie is a farm boy with big dreams of being a singer, he ends up running away to avoid war. He ends up following his dreams in ways he’s never imagined and if he isn’t careful his dreams might turn to nightmares."},"Into the Wolf's Den":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7383&ageconsent=ok&warning=3'","author":"RoryRouses","authorUrl":"viewuser.php?uid=15523","summary":"After attempting to capture and enslave lycan (wolf people) women and children, Jaren is captured and given the opportunity to right his wrongs. (This is a full short story with a sexy MTF scene! Contains forced TF and enslavement, but isn't super mean spirited)"},"Clara and Oliver":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7380&ageconsent=ok&warning=3'","author":"bigbustgazer","authorUrl":"viewuser.php?uid=15789","summary":"One day things changed drastically, a second puberty was added during which everyone developed a second set of genitalia of the opposite sex from their originals. Everyone's bodies adjusts as if this was always the case, but nothing else did, their clothing did not change. Clara goes from straight to Bi. Oliver changes more than expected."},"The Ray Gun":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7379&ageconsent=ok&warning=3'","author":"Ighten","authorUrl":"viewuser.php?uid=16345","summary":"When Doug discovers his grandfather's lost invention, he has no idea of the pleasures and consequences it will bring."},"Demoness of the Hall":{"titleUrl":"viewstory.php?sid=6574","author":"JAK","authorUrl":"viewuser.php?uid=11064","summary":"W is having a bad first day of school. Starting from ground zero with no friends all over again, struggling to figure out how to navigate the large campus... oh, right, and being mugged by a literal demon girl in the hallway.\nSet in a world where part of growing up is metamorphosizing into a demi-human in line with your true self, what then happens to a high schooler that refuses to accept who they are? Forced to live as the lone human among a menagerie of incredible peers, will W figure out what they've been missing all along?"},"A Little More than They Bargained For":{"titleUrl":"viewstory.php?sid=7378","author":"stargirl67","authorUrl":"viewuser.php?uid=16357","summary":"When Eragon Shadeslayer gets transformed by the elves, things go a little awry for the young Dragon Rider"},"Going Down":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7377&ageconsent=ok&warning=3'","author":"Lycandope","authorUrl":"viewuser.php?uid=3515","summary":"Three men discover a bit of magic in an elevator after harassing a group of women.\n\nA gift story for the amazing cluedog based on a scenario they came up with!  Find their work here:  https://www.deviantart.com/cluedog\n\nI've always loved their work and it's a pleasure to give back to creators who've helped shape me over the years :)"},"Genie Troubles":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7375&ageconsent=ok&warning=3'","author":"Razmagurk","authorUrl":"viewuser.php?uid=10658","summary":"Evangeline just used a genie's wish to turn herself into her ex's greatest fantasy. Wait, what do you mean he was really into futanari? That's fine, there's still plenty of wishes left! It's not as though she's going to accidentally give guys everywhere vaginas or turn them into women, right? As long as they get their happy ending it'll all be worth it, won't it?"},"Freshly Poached":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7370&ageconsent=ok&warning=3'","author":"RoryRouses","authorUrl":"viewuser.php?uid=15523","summary":"We follow Jeremy who attempts to poach an egg from a harpy village in order to make big money.  As you can expect, it doesn't go as planned.   Very sexy TG TF, man-to-harpy sequence with an extensive and sexy egg-laying scene. (contains forced/non-consensual transformation; you have been warned)"},"Dawn at Last":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7369&ageconsent=ok&warning=3'","author":"Ighten","authorUrl":"viewuser.php?uid=16345","summary":"A desperate man uses a magical amulet to possess the body of his crush, but soon realizes he picked the wrong night."},"A Wistful Witch":{"titleUrl":"viewstory.php?sid=7293","author":"MaybeMergirl","authorUrl":"viewuser.php?uid=15261","summary":"Kaden had grown up more in worlds of fantasy than real. Growing up without parents in foster care, he was raised more by Harry Potter and Lord of the Rings than actual people. When Kaden gets adopted however, he discovers that perhaps his fantasy stories were more real than he had thought..."},"God Speak - Book One - The Portal Builder":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=1535&ageconsent=ok&warning=3'","author":"Korra Del Rio","authorUrl":"viewuser.php?uid=3923","summary":"The realms are aligning as the places of power come together in an unprecedented fashion. In all the realms, of all the gods, demons, deities, and lesser folk. An impossible chance encounter pulls together our cast of hapless heroes and a incompetent summoner. Together they'll build a bridge to another plane if they don't manage to kill themselves in the process."},"The Summer I Became Her":{"titleUrl":"viewstory.php?sid=7202","author":"Alternativeaccount11","authorUrl":"viewuser.php?uid=15642","summary":"13 year old Nathan Kent’s life is turned upside down as a school makes a really big mix up with his test results. What comes next is a story of Feminine fun, fashion, and romance."},"Gym Gurl":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7366&ageconsent=ok&warning=3'","author":"RoboticCorg","authorUrl":"viewuser.php?uid=16339","summary":"Typical Gym Bro finds out what can happen when he makes ill-timed comments to the wrong gym girl"},"Slaves of the Arch-Slime":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7349&ageconsent=ok&warning=3'","author":"CorruptedHeroines","authorUrl":"viewuser.php?uid=16307","summary":"When two adventurers step into the wrong dungeon, they slowly find themselves transformed into more suitable, feminine forms… a hot 18+ story of betrayal, gender bender and detailed body modification!"},"Promotion To Staci":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7262&ageconsent=ok&warning=3'","author":"gotuk","authorUrl":"viewuser.php?uid=16163","summary":"Waiting for his next promotion Terrace is ready to have it all. Having tread up on his way to the top, he might not be too pleased to be suddenly forced back at the bottom."},"Starlet":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7342&ageconsent=ok&warning=3'","author":"FoxFace","authorUrl":"viewuser.php?uid=15314","summary":"Robert is a camera operator working in Hollywood who is accidentally transported via a magical video reel back to the Golden Age of Hollywood as a budding bombshell of a starlet! Suddenly stuck as Rachel Carmine, a gorgeous twenty year old woman on her way to fame, the new female must navigate not just her new time period and job, but also her attractive new gender that is being plastered all across the country. A commissioned story for aabcehm."},"A Day at the Beach":{"titleUrl":"viewstory.php?sid=7365","author":"Tamara B","authorUrl":"viewuser.php?uid=16246","summary":"A short story about a trip to the beach and a casual encounter."},"In the Darkness is the Light":{"titleUrl":"viewstory.php?sid=6195","author":"Cabbitgurl","authorUrl":"viewuser.php?uid=6962","summary":"A young orphan boy's careless wish for power leads him spiraling into the world of the Umbra Girls. Girls with magick powers that are the only thing that can stop the Luminescent."},"Dahlia's Curse":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has deviant content. It may depict one or more illegal and or immoral activities. Your laws may limit your lawful reading of such material. -- 1')) location = 'viewstory.php?sid=7361&ageconsent=ok&warning=4'","author":"Sum1Odd","authorUrl":"viewuser.php?uid=15231","summary":"Nick Sutter is perfectly happy working diligently as a paralegal for a humble little law firm downtown, staying faithful to his ideal girlfriend, and generally living a good clean life. Enter Dahlia Maddison, who is prepared to turn everything upside down. \n\nTW: There are some flashes of a non-consentual sex scene, and implied coercion is an ongoing theme throughout this story."},"Tales of The Divine Wish":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7170&ageconsent=ok&warning=3'","author":"Raven","authorUrl":"viewuser.php?uid=665","summary":"A divine wish is something that is granted by the powers of the universe.  However, if any wish directly affects another person, that person will receive another wish to balance the cosmic scales once the first wish is fulfilled in its totality.   Additionally, reality will warp around the wish maker and any person directly affected to make that wish happen.   The longer a person directly affected is in denial, holds out, or attempts to thwart the fulfillment of the wish, the more reality will warp to make it happen.  These are some of those stories, in no particular sequence"},"I Am Courtney James":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7345&ageconsent=ok&warning=3'","author":"Raven","authorUrl":"viewuser.php?uid=665","summary":"A man is the victim of a body-swapping alien invasion."},"The Hired Bridesmaid ":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7360&ageconsent=ok&warning=3'","author":"Terri Fischer ","authorUrl":"viewuser.php?uid=11898","summary":"A bride suddenly finds herself short one bridesmaid. Her only option is to hire one. Discovering that the owner of the local bridal shop has a daughter may be the solution. But the daughter seems oddly familiar and more appealing than the groom. A formula for heartbreak? Or a happy ending?"},"O Fortuna":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7328&ageconsent=ok&warning=3'","author":"Loup","authorUrl":"viewuser.php?uid=10887","summary":"Fred is a middle-aged man who has everything and is still miserable. He's cheating on his wife, he's jealous of his younger subordinates. But when he encounters the goddess of fortune, he gets a new lease on life. Story with images."},"Dimensions of Desire":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7324&ageconsent=ok&warning=3'","author":"TheSpiralledEye","authorUrl":"viewuser.php?uid=15372","summary":"Liam is a stressed businessman who just wants to let go. Thanks to his connections he manages to have scientists construct machines that can let him create his ultimate w**** fantasies and live them out in vivid detail."},"The House Always Wins":{"titleUrl":"viewstory.php?sid=7359","author":"Connie Hollis","authorUrl":"viewuser.php?uid=16167","summary":"The Grand Desert Rose is a Hotel and Casino on the Las Vegas Strip. Four friends have a bill they can’t pay. The casino offers them a game of poker in exchange for their debt. But if they loose, they’ll have to pay with more than money."},"Road Head":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7358&ageconsent=ok&warning=3'","author":"ReluctantAdmirer","authorUrl":"viewuser.php?uid=11304","summary":"After aggressively hitting on a woman at the bar, Connor and Karl race through the countryside to find the person responsible for Karl's current predicament. \n\nA one-part romp."},"Club Venus (Short Story) ":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7357&ageconsent=ok&warning=3'","author":"Nothing To See Here","authorUrl":"viewuser.php?uid=14524","summary":"A guy named Alejandro decides to take his friend Kristine to a popular strip club in their city called Club Venus in an attempt to give her more confidence. He achieves his goal with the help of a male stripper, but not in the way he expected."},"Firsts":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7050&ageconsent=ok&warning=3'","author":"Icebolt","authorUrl":"viewuser.php?uid=9532","summary":"A new semester begins, and for Micheal Hurt, the newest student at Western Thaumaturgic University, it is a time of firsts."},"Girls' Night Out":{"titleUrl":"viewstory.php?sid=7356","author":"AnnaliseB","authorUrl":"viewuser.php?uid=11602","summary":"James is excited to meet Cathryn again and spend some quality time with her. Her flatmates have different ideas and want to humiliate him, through enforced feminisation, but only for the night."},"Keeping Up With . . .":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7355&ageconsent=ok&warning=3'","author":"FoxFace","authorUrl":"viewuser.php?uid=15314","summary":"Trevor really hates reality TV and is annoyed that his girlfriend Jasmine is always watching famous reality model families and catty housewives shows. When he goes too far one day, she traps him in an alternate reality where he is a new reality model star with her own show, and married to his favourite rapper. A short, dark story."},"A Short Burst of Life":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7354&ageconsent=ok&warning=3'","author":"LeftyPosting","authorUrl":"viewuser.php?uid=14757","summary":"The things we do alone in our bedrooms, locked away from the rest of the world. ***This story includes an AI generated section by ChatGPT***"},"The Raven's call":{"titleUrl":"viewstory.php?sid=5549","author":"Lone elephant ","authorUrl":"viewuser.php?uid=12788","summary":"Will is a normal 17 year old stable boy. He finds himself in a situation where he has to sacrifice everything for the sake of someone he hates."},"Rose Colored Glasses":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7295&ageconsent=ok&warning=3'","author":"ReluctantAdmirer","authorUrl":"viewuser.php?uid=11304","summary":"Rose picks up a stranger at a bar for a one-night stand after a stressful semester teaching at her University. But the stranger isn't all he seems, and he has plans for Rose. Does he intends to help her? Or hurt her?"},"Conflicted Love":{"titleUrl":"viewstory.php?sid=7327","author":"Yona","authorUrl":"viewuser.php?uid=16269","summary":"A memoir that outlines my experiences waking up with a completely different life, and how love trapped me there."},"Layla loves boys":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has deviant content. It may depict one or more illegal and or immoral activities. Your laws may limit your lawful reading of such material. -- 1')) location = 'viewstory.php?sid=7294&ageconsent=ok&warning=4'","author":"trashlikeyou","authorUrl":"viewuser.php?uid=16224","summary":"A young man moves to Western Europe from the U.S. with an all expenses paid scholarship. Cash in hand, he finds a cheap room in a midsize city and prepares to begin his studies. But the people he meets have their own stories. Maybe it’s for the best. Given a push, he sets off down a path that he was never meant to tread. What unforeseen pleasure awaits him at the hands of fate? It may be that destiny has placed them together. Some of us are explorers, but others need to be led."},"Aprille's World":{"titleUrl":"viewstory.php?sid=7350","author":"Aprille Blossom","authorUrl":"viewuser.php?uid=14902","summary":"Strange, magical lands? A town stuck in time? Welcome to Aprille's World, a collection of short  fantasy MTF stories brought to you by yours truly! This is a collection of  tales which are designed to take you on fun, new adventures. Each \"chapter\" will be it's own journey, so be sure to check back when there are updates! I hope you enjoy!"},"Teen Show - Faith & Gracie":{"titleUrl":"viewstory.php?sid=7190","author":"myother123","authorUrl":"viewuser.php?uid=15577","summary":"After barging into his sister's room uninvited for the thousandth time, Finn causes Gracie to botch a magic spell that leaves them trapped in a sitcom universe as twins Faith and Gracie. While Gracie works to undo the spell and send them home, Finn is stuck playing her girly girl sister Faith."},"New Filter (Short Story) ":{"titleUrl":"viewstory.php?sid=7346","author":"Nothing To See Here","authorUrl":"viewuser.php?uid=14524","summary":"There's a new app where you can edit your pictures how you want, and every filter looks very realistic, so realistic that you could edit a picture of yourself to look like the opposite sex and transform you into how the filter makes you look!\nA young man named Daniel downloads the app and tries out the body mod filters, and enjoys the results"},"Imposter Mommy":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has deviant content. It may depict one or more illegal and or immoral activities. Your laws may limit your lawful reading of such material. -- 1')) location = 'viewstory.php?sid=7344&ageconsent=ok&warning=4'","author":"Lady Kyrie","authorUrl":"viewuser.php?uid=16303","summary":"Joshua is tired of being controlled by his mother while his bratty sister gets everything she wants. Fortunately, with the help of a friend and a skinsuit of his mother, her about to get all the revenge he's ever wanted, starting with his sister."},"Hotel Crossplay":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7343&ageconsent=ok&warning=3'","author":"Lady Kyrie","authorUrl":"viewuser.php?uid=16303","summary":"In this little vignette, Kenji has been brought to Hotel Crosplay by his best friend, Hiro, for Kenji's eighteenth birthday. Hotel Cosplay is a club famous for its girls' ability to cosplay any female character perfectly. Kenji isn't sure how someone like Hiro got a job here, but now he's being forced to do the one thing he has the least experience doing. Talking to a girl! Oh, and having sex."},"Annnnnd Scene!":{"titleUrl":"viewstory.php?sid=6153","author":"Beregeist","authorUrl":"viewuser.php?uid=14114","summary":"The band Andy plays for needs a big break, but summoning a supernatural entity to hammer out the details has some terrible consequences."},"Caught in a new life":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has deviant content. It may depict one or more illegal and or immoral activities. Your laws may limit your lawful reading of such material. -- 1')) location = 'viewstory.php?sid=5635&ageconsent=ok&warning=4'","author":"Fibaro","authorUrl":"viewuser.php?uid=11775","summary":"A wife catches her husband jerking off to sissy p*** and punishes him. This story ties in to my story Neightbourhood Terror to sissy so reading that first might be advised."},"The Sissy School":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=2892&ageconsent=ok&warning=3'","author":"John_more_like_Joanne","authorUrl":"viewuser.php?uid=7054","summary":"The sissy school transformation of John into Joanne after his wife caught him in her panties."},"Changing Priorities":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7340&ageconsent=ok&warning=3'","author":"Razmagurk","authorUrl":"viewuser.php?uid=10658","summary":"College burnout Dylan is at the end of his rope and eager for a way out. Thanks to this magic necklace, he has one! It changes a person's life so they'd be who they were if their priorities were different. He just never thought it would turn him into a girl along the way. Now, necklace in hand, he has to find what kind of person he wants to be. And if that means being a sexy girl at that raging party tonight, well more power to him, right?"},"The World Turns":{"titleUrl":"javascript:if(confirm('Age Consent Required - I am of the age of consent in my locale to view materials with adult content.  I realize that by agreeing, the normal warnings for stories with adult content will be by-passed. This story has explicit content. It may involve descriptions or depictions of intense sexual activity. -- 1')) location = 'viewstory.php?sid=7041&ageconsent=ok&warning=3'","author":"bigbustgazer","authorUrl":"viewuser.php?uid=15789","summary":"One day things changed drastically, a second puberty was added during which everyone developed a second set of genitalia of the opposite sex from their originals. Everyone's bodies adjusts as if this was always the case, but nothing else did, their clothing did not change."}}